
import { Hotspot } from './types';

export const MIRROR_HOTSPOTS: Hotspot[] = [
  {
    "id": 1,
    "title": "半球钮",
    "description": "半球钮用于穿系镜绶，也是一切纹饰构图的中心锚点。中唐时期镜钮多更趋规整，周围纹饰常以“中心—环带—瓣缘”的方式层层展开，既方便佩挂，也让镜背的主题叙事更集中。",
    "x": 49.3,
    "y": 50.6,
    "category": "structure"
  },
  {
    "id": 2,
    "title": "腾龙纹",
    "description": "内区环绕镜钮布置，展现了矫健有力的龙纹。唐代铜镜中的龙纹常呈盘旋状，躯干矫健，鳞甲清晰，体现了盛世大唐追求的宏大力量感与祥瑞气息，腾龙纹主要流行于唐代中期。",
    "x": 50.1,
    "y": 44,
    "category": "inner"
  },
  {
    "id": 3,
    "title": "小鸟逐蝶",
    "description": "镜缘纹饰之一：小鸟逐蝶，展翅欲飞。唐代铜镜纹饰常见此类富有生活情趣的自然景象，表现出盛唐时期活泼、写实的艺术风格。",
    "x": 41.4,
    "y": 68.1,
    "category": "outer"
  },
  {
    "id": 4,
    "title": "折枝莲叶",
    "description": "镜缘纹饰之一：折枝莲叶，穿插在飞鸟之间，起到了填充与连接的作用。这种丰满的构图方式让画面显得流动而不杂乱，是唐代工艺美术“满而有序”审美的典型体现。",
    "x": 57.1,
    "y": 70.6,
    "category": "outer"
  },
  {
    "id": 5,
    "title": "衔绶飞鸟纹",
    "description": "镜缘纹饰之一：衔绶飞鸟，飞鸟口中衔有丝带（绶带），寓意“长寿”与“加官进禄”。这种祝颂式纹样在唐镜中非常普遍，体现了当时人们对美好世俗生活的向往。",
    "x": 34.3,
    "y": 43.2,
    "category": "outer"
  },
  {
    "id": 6,
    "title": "凤鸟纹",
    "description": "内区纹饰之一：凤鸟纹，展翅舞凤立于镜钮两侧，伫立在莲花上，对鸟形式的纹饰布局多见于盛唐时期，象征着高洁与祥瑞。",
    "x": 42.9,
    "y": 51.4,
    "category": "inner"
  },
  {
    "id": 7,
    "title": "八瓣葵花形",
    "description": "八瓣葵花形镜主要流行于唐代中期，打破了汉魏以来圆镜、方镜的传统模式，使得铜镜的外形更加优美多姿，富有装饰性。",
    "x": 50,
    "y": 30.5,
    "category": "structure"
  },
  {
    "id": 8,
    "title": "莲枝莲花",
    "description": "内区纹饰：莲枝莲花。缠绕蔓延的“缠枝莲”纹样，象征着家族像藤蔓一样根基稳固、长久繁荣，展现了唐代人对于自然之美与吉祥意蕴的追求。",
    "x": 57.7,
    "y": 60.3,
    "category": "inner"
  }
];
